{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "hi",
        "hello",
        "hey",
        "good morning",
        "good afternoon",
        "good evening",
        "is anyone there",
        "are you there",
        "hiya",
        "how are you"
      ],
      "responses": [
        "Hello! I'm the DeKUT Assistant — ask me anything about the university and I’ll help.",
        "Greetings! I’m here to help you with information about Dedan Kimathi University of Technology."
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "bye",
        "goodbye",
        "see you",
        "see you later",
        "i'm leaving",
        "talk to you later",
        "ttyl",
        "cya"
      ],
      "responses": [
        "Goodbye! If you need more information later, come back anytime."
      ]
    },
    {
      "tag": "about_university",
      "patterns": [
        "tell me about the university",
        "What is Dedan Kimathi University?",
        "Tell me about DeKUT",
        "Information on Dedan Kimathi University of Technology",
        "what is dekut",
        "about dkut",
        "about dedan kimathi",
        "what is Dedan Kimathi University of Technology"
      ],
      "responses": [
        "Dedan Kimathi University of Technology (DeKUT) is a premier 'Entrepreneurial University' located in Nyeri. It operates on the 'Triple Helix' model, linking government, academia, and industry."
      ]
    },
    {
      "tag": "history_legacy",
      "patterns": [
        "history of dekut",
        "when was dekut started",
        "When was DeKUT founded",
        "university background",
        "What is the history of Dedan Kimathi University",
        "How did Dedan Kimathi University start",
        "Tell me about the origins of DeKUT",
        "kimathi institute of technology"
      ],
      "responses": [
        "The university started in 1972 as Kimathi Institute of Technology (KIT) through the 'Harambee' spirit.It was chartered as a full public university on December 14, 2012, by President Mwai Kibaki.It is named after Field Marshal Dedan Kimathi to honor the struggle for independence and liberation through education."
      ]
    },
    {
      "tag": "location",
      "patterns": [
        "where is dekut",
        "where is dedan kimathi located",
        "location of dekut",
        "where is the university located",
        "Address of Dedan Kimathi University",
        "address of dkut",
        "Where is DeKUT main campus",
        "how far is dekut from nyeri",
        "location of university"
      ],
      "responses": [
  "Dedan Kimathi University of Technology is located about 6 km from Nyeri town along the Nyeri Mweiga highway.It sits on resource-rich grounds near Mt. Kenya, which supports its specialized mountaineering and tourism programs."
      ]
    },
    {
      "tag": "contacts",
      "patterns": [
        "what is the phone number",
        "contact number",
        "how can i contact the university",
        "dekut phone",
        "university contact",
        "email for dekut",
        "Dedan Kimathi University phone number",
        "admissions contact"
      ],
      "responses": [
        "You can reach Dedan Kimathi University of Technology (DeKUT) at: Main Campus contact and email:0713835965 email:marketing@dkut.ac.ke  and Nairobi CBD center contact and email : 0710127516 email directornairobi@dkut.ac.ke."
      ]
    },
    {
      "tag": "office_hours",
      "patterns": [
        "what are the office hours",
        "when is the university open",
        "working hours",
        "hours of operation",
        "when are you open"
      ],
      "responses": [
        "The University generally operates Monday to Friday from 8:00 AM to 5:00 PM. Offices are usually closed on weekends and public holidays."
      ]
    },
    {
      "tag":"contact_schoolofengineering",
      "patterns":[
        "Contact details for School of engineering",
        "Email for School of Engineering DeKUT",
        "School of Engineering contacts",
        "Give me the phone number for the School of Engineering",
        "What is the email for the engineering department"
      ],
      "responses":[
        "You can contact the School of Engineering at Dedan Kimathi University using the following details:Mobile 0713835969 Email dean_soe@dkut.ac.ke"
      ]
    },
    {
      "tag":"contact_schoolofbusiness",
      "patterns":[
        "Contact details for School of business",
        "Email for School of business DeKUT",
        "School of business contacts",
        "Give me the phone number for the School of business",
        "What is the email for the engineering department"
      ],
      "responses":[
        "You can contact the School of Business,Management and Economics at Dedan Kimathi University using the following details:Mobile 0713835403 Email schoolofbusines@dkut.ac.ke"
      ]
    },
    {
      "tag":"contact_schoolofscience",
      "patterns":[
        "Contact details for School of science",
        "Email for School of science DeKUT",
        "School of science contacts",
        "Give me the phone number for the School of science",
        "What is the email for the science department"
      ],
      "responses":[
        "You can contact the School of Science at Dedan Kimathi University using the following details:Mobile 0701782892 Email dean-sos@dkut.ac.ke"
      ]
    },
    {
      "tag":"contact_schoolofnursing",
      "patterns":[
        "Contact details for School of nursing",
        "Email for School of nursing DeKUT",
        "School of nursing contacts",
        "Give me the phone number for the School of nursing",
        "What is the email for the nursing department"
      ],
      "responses":[
        "You can contact the School of Nursing at Dedan Kimathi University using the following details:Mobile 0700711628 Email nursing@dkut.ac.ke"
      ]
    },
    {
      "tag":"contact_schoolofscomputerscience",
      "patterns":[
        "Contact details for School of computer science",
        "Email for School of computer science DeKUT",
        "School of Computer science and IT contacts",
        "Give me the phone number for the School of computer science",
        "What is the email for the computer science and IT department"
      ],
      "responses":[
        "You can contact the School of Computer Science and IT  at Dedan Kimathi University using the following details:Mobile 0713835979 Email dean-cs-it@dkut.ac.ke"
      ]
    },
    {
      "tag":"contact_schoolofgraduatestudies",
      "patterns":[
        "Contact details for School of Gradaute studies",
        "Email for School of Graduate studies DeKUT",
        "School of Computer graduate studies contacts",
        "Give me the phone number for the School of Gradauate studies",
        "What is the email for the Gradauate Studies department"
      ],
      "responses":[
        "You can contact the School of Graduate Studies at Dedan Kimathi University using the following details:Mobile 0709202939 Email graduateschool@dkut.ac.ke"
      ]
    },
    {
      "tag":"contact_instituteoftechnicalstudies",
      "patterns":[
        "Contact details for Insitute of technical studies",
        "Email for itps",
        "Institute of techncal and professional studies contact",
        "Give me the phone number for the itps",
        "What is the email for the ITPS department"
      ],
      "responses":[
        "You can contact the Institute of Technical and Professional Studies at Dedan Kimathi University using the following details:Mobile 0713835396 Email itps@dkut.ac.ke"
      ]
    },
    {
      "tag":"contact_instituteofgematics",
      "patterns":[
        "Contact details for Insitute of Geomatics",
        "Email for GIS",
        "Institute of Geomatics and Remote sensing contact",
        "Give me the phone number for the IGGRes",
        "What is the email for the Institute of Geomatics,GIS and Remote sensing department"
      ],
      "responses":[
        "You can contact the Institute of Geomatics,GIS and Remote sensing at Dedan Kimathi University using the following details:Mobile 0713835396 Email itps@dkut.ac.ke"
      ]
    },
    {
      "tag":"contact_instituteoftourism",
      "patterns":[
        "Contact details for Insitute of Tourism and Hospitality Management",
        "Email for ITOHM",
        "Institute of Tourism and Hospitality Management contact",
        "Give me the phone number for the ITOHM",
        "What is the email for the Institute of Tourism and Hospitality Management department"
      ],
      "responses":[
        "You can contact the Institute of Tourism and Hospitality Management at Dedan Kimathi University using the following details:Mobile 0716659395 Email itohmoffice@dkut.ac.ke"
      ]
    },
    {
      "tag":"contact_instituteoffood",
      "patterns":[
        "Contact details for Insitute of Food and Bioresource Technology",
        "Email for IFBT",
        "Institute of Food and Bioresource Technology contact",
        "Give me the phone number for the IFBT",
        "What is the email for the Institute of Food and Bioresource Technology department"
      ],
      "responses":[
        "You can contact the Institute of Food and Bioresource Technology at Dedan Kimathi University using the following details:Mobile 0729373564 Email ifbt@dkut.ac.ke"
      ]
    },
    {
      "tag":"contact_Geothermalinstitute",
      "patterns":[
        "Contact details for Geothermal Institute",
        "Email for GETRI",
        "Geothermal Energy Training and Research Institute contact",
        "Give me the phone number for the GETRI",
        "What is the email for the Geothermal Energy Training and Research Institute  department"
      ],
      "responses":[
        "You can contact the Geothermal Energy Training and Research Institute  at Dedan Kimathi University using the following details:Mobile 0110002455 Email getri@dkut.ac.ke"
      ]
    },
    {
      "tag": "admissions_general",
      "patterns": [
        "how do i apply",
        "admission requirements",
        "admissions process",
        "entry requirements",
        "how to apply to dekut",
        "how much is the application fee",
        "apply as a self sponsored student",
        "KUCCPS application",
        "online application link"
      ],
      "responses": [
        "You can apply as a Government Sponsored (KUCCPS) or Self-Sponsored (SSP) student. Applications are digitized via the university portal.Application fees are KES 3,000 for PhD, KES 1,500 for Masters, and KES 1,000 for Undergraduate.How to Apply:Visit the portal, select your preferred program, and follow the instructions here: https://admissions.dkut.ac.ke/"
      ]
    },
  
    {
      "tag": "fees_general",
      "patterns": [
        "fee structure",
        "how much is tuition",
        "fees for students",
        "tuition fees",
        "how much does it cost",
        "fee details",
        "how to pay fees"
      ],
      "responses": [
        "Fees vary by program and sponsorship type. Payments can be made via M-PESA (Business Number 222222) or direct bank deposits.Always use your registration number as the account reference."
      ]
    },
    {
      "tag": "financial_aid",
      "patterns": [
        "financial aid",
        "bursaries",
        "work study",
        "defao",
        "help with school fees"
      ],
      "responses": [
        "The DeKUT Financial Aid Office (DeFAO) manages bursaries and a Work-Study program that allows students to work part-time within the university to earn money for their upkeep[cite: 312, 313]."
      ]
    },
    {
      "tag": "accommodation",
      "patterns": [
        "is there hostel",
        "do you have accommodation",
        "campus accommodation",
        "student hostels",
        "where do students stay",
        "on-campus housing",
        "external hostels"
      ],
      "responses": [
        "DeKUT has limited internal hostels (approx. 152 spaces). Most students reside in vetted external hostels like Tazama Place, Kirathimo, and Sunrise Hostel. [cite_start]Rents range from KES 2,500 to KES 10,000 per month[cite: 255, 259, 260]."
      ]
    },
    {
      "tag": "student_life",
      "patterns": [
        "student life",
        "clubs and societies",
        "dekutso",
        "sports",
        "rugby",
        "climb to educate"
      ],
      "responses": [
        "Student life is vibrant with the DeKUTSO student council, professional clubs (Computer Society, Actuarial Association), and sports like the Mt. Kenya 7s Rugby Tournament. [cite_start]Unique activities include the 'Climb to Educate' mountaineering expedition[cite: 264, 270, 284]."
      ]
    },
    {
      "tag": "alumni",
      "patterns": [
        "notable alumni",
        "famous graduates",
        "who studied at dekut",
        "joshua ndemenge"
      ],
      "responses": [
        "Notable alumni include Joshua Ndemenge (Microsoft Cloud Developer Advocate), Peris Njeri Wainaina (Leather entrepreneur), and Kelvin Ngeno (Tech innovator). [cite_start]The university has also awarded honorary degrees to figures like Thabo Mbeki[cite: 326, 329, 336]."
      ]
    },
    {
      "tag": "student_portal",
      "patterns": [
        "student portal",
        "portal login",
        "how to access portal",
        "student login",
        "where do i register units",
        "portal"
      ],
      "responses": [
        "Students access course registration, fee statements and other services via the DeKUT student portal. If you need the portal link or guidance logging in, check the university website or contact ICT support."
      ]
    },
    {
      "tag": "help_how_to_use",
      "patterns": [
        "help",
        "how do i use this",
        "what can you do",
        "how can you help",
        "what can you help me with"
      ],
      "responses": [
        "I can provide information about DeKUT programmes, admissions, contacts, fees, department leadership and more. Ask a specific question like 'What are the engineering programmes?' or 'Who is the dean of engineering?'."
      ]
    },
    {
      "tag": "unknown",
      "patterns": [
        "i don't know what to ask",
        "random question",
        "can you answer anything",
        "not sure"
      ],
      "responses": [
        "If you're not sure where to start, try asking about admissions, programmes, or contact details. For example: 'What courses does the School of Engineering offer?'"
      ]
    },
    {
      "tag": "creator",
      "patterns": [
        "who created you",
        "who developed you",
        "who made you",
        "your developer",
        "developer information"
      ],
      "responses": [
        "I was created by Cheryl Achieng as part of a DeKUT final year project."
      ]
    },
    {
      "tag": "engineering_overview",
      "patterns": [
        "tell me about the school of engineering",
        "school of engineering details",
        "about engineering school",
        "engineering faculty at dekut",
        "overview of engineering school"
      ],
      "responses": [
        "The School of Engineering at DeKUT offers undergraduate and postgraduate programmes focused on practical engineering skills, research and industry partnerships. The school emphasizes hands-on training and applied research across multiple engineering disciplines."
      ]
    },
    {
      "tag": "engineering_leadership_departments",
      "patterns": [
        "who is the dean of engineering",
        "engineering dean",
        "who leads the school of engineering",
        "departments in engineering",
        "engineering departments list"
      ],
      "responses": [
        "The School of Engineering is led by Dean Dr. Njenga Mburu. Departments include Chemical Engineering (HoD Dr. Kimutai Tewo), Technology Education (HoD Dr. Addero Wilson Ogot), Civil Engineering (HoD Dr. Kevin Achieng), Electrical & Electronic Engineering (HoD Dr. Edwell Tafara Mharakurwa), Mechatronic Engineering (HoD Dr. Titus Murwa Mulembo), Mechanical Engineering (HoD Dr. Mburu Ngugi)."
      ]
    },
    {
      "tag": "engineering_undergraduate_programs",
      "patterns": [
        "engineering undergraduate programs",
        "engineering courses",
        "what engineering courses are offered",
        "list of engineering courses",
        "bsc engineering courses",
        "bsc Chemical Engineering",
        "bsc Civil Engineering",
        "bsc Electrical & Electronic Engineering",
        "bsc Mechatronic Engineering ",
        "Telecommunication & Information Engineering",
        "bsc Mechanical Engineering"
      ],
      "responses": [
        "Undergraduate programmes in the School of Engineering include: BSc Electrical & Electronic Engineering, BSc Telecommunication & Information Engineering, BSc Mechatronic Engineering, BSc Mechanical Engineering, BSc Chemical Engineering, BSc Civil Engineering, BEd Technology (Electrical & Electronic), BEd Technology (Mechanical) and BEd Technology (Civil)."
      ]
    },
    {
      "tag": "engineering_postgraduate_programs",
      "patterns": [
        "engineering masters programs",
        "engineering postgraduate courses",
        "msc engineering courses",
        "phd engineering",
        "postgraduate engineering programs"
      ],
      "responses": [
        "Postgraduate programmes include M.Sc. in Advanced Manufacturing & Automation Engineering, Machine Tools Design & Manufacturing, Industrial Engineering & Management, Telecommunication Engineering, Mechanical Engineering, Biomedical Engineering, Civil Engineering, and a PhD in Mechanical Engineering. Requirements typically include a relevant BSc with an upper second-class honours or equivalent and, in some cases, relevant work experience."
      ]
    },
    {
      "tag": "engineering_entry_requirements",
      "patterns": [
        "engineering entry requirements",
        "requirements for engineering",
        "how to join engineering",
        "minimum requirements for engineering courses"
      ],
      "responses": [
        "Minimum entry for most engineering undergraduate programmes is a KCSE mean grade of C+ with passes in Physics, Chemistry, English and Kiswahili (or equivalent). Specific programmes may have additional subject requirements; please specify the programme for precise entry requirements.",
        "Generally, engineering degree programmes require a KCSE mean grade of C+ and good performance in the relevant science subjects. Contact admissions for programme-specific criteria."
      ]
    },
    {
      "tag": "cs_overview",
      "patterns": [
        "tell me about the school of computer science",
        "school of computer science details",
        "computer science school at dekut",
        "about cs school"
      ],
      "responses": [
        "The School of Computer Science & Information Technology offers undergraduate and postgraduate programmes focused on software, systems and data science. The school emphasizes practical computing skills, cybersecurity, and research in modern IT disciplines."
      ]
    },
    {
      "tag": "cs_leadership_departments",
      "patterns": [
        "who is the dean of computer science",
        "computer science dean",
        "who leads cs school",
        "cs departments",
        "departments in computer science"
      ],
      "responses": [
        "The School of Computer Science & Information Technology is led by Dean Dr. George Musumba with Dr. Kinyua Gikunda as a key departmental lead. The school includes programmes in computer science, information technology and business information technology."
      ]
    },
    {
      "tag": "cs_undergraduate_programs",
      "patterns": [
        "computer science courses",
        "what computer science programmes do you offer",
        "bsc computer science list",
        "undergraduate it courses",
        "it courses at dekut",
        "IT courses at dekut",
        "bbit courses at dekut"
      ],
      "responses": [
        "Undergraduate programmes include: BSc Computer Science, BSc Information Technology, and BSc Business Information Technology. Entry requirements vary; BSc Computer Science typically requires a C+ in Mathematics and a C+ in Physical Sciences or an equivalent combination of qualifications."
      ]
    },
    {
      "tag": "cs_postgraduate_programs",
      "patterns": [
        "computer science masters",
        "msc computer science",
        "postgraduate it courses",
        "phd computer science",
        "masters in data science"
      ],
      "responses": [
        "The school offers master's degrees in Computer Science, Cybersecurity and Data Science, as well as PhD opportunities for qualified candidates with a relevant master's degree."
      ]
    },
    {
      "tag": "cs_entry_requirements",
      "patterns": [
        "computer science requirements",
        "requirements for computer science",
        "how to join computer science",
        "entry requirements for it"
      ],
      "responses": [
        "Minimum entry varies by programme. Most computer science and IT courses require a KCSE mean grade of C+ and a C plain in Mathematics and English/Kiswahili. BSc Computer Science may require a higher performance in Mathematics and Physical Sciences."
      ]
    },
    {
      "tag": "science_overview",
      "patterns": [
        "tell me about the school of science",
        "school of science details",
        "about science school",
        "science faculty dekut",
        "overview of school of science"
      ],
      "responses": [
        "The School of Science at DeKUT offers programmes in natural sciences, chemistry, physics, mathematics, statistics, actuarial science and applied sciences. The school focuses on research, laboratory-based training and strong analytical skills development."
      ]
    },
    {
      "tag": "science_leadership_departments",
      "patterns": [
        "who is the dean of science",
        "science dean",
        "science departments",
        "departments in school of science",
        "leadership in school of science"
      ],
      "responses": [
        "The School of Science is led by Dean Dr. Antony Ngunyi. Departments include Chemistry (HoD Dr. Paul Tanui), Mathematics & Physical Sciences (HoD Dr. Reuben Ndung’u), and Statistics & Actuarial Science (HoD Dr. Cyprian Omari)."
      ]
    },
    {
      "tag": "science_undergraduate_programs",
      "patterns": [
        "science courses",
        "what courses are offered in school of science",
        "undergraduate science programmes",
        "degree programs in science",
        "BSc Actuarial Science",
        "BSc Industrial Chemistry",
        "BSc Leather Technology",
        "BSc Polymer Chemistry",
        "BSc Medical Physics",
        "BSc Mathematics & Modeling Processes"
      ],
      "responses": [
        "The school offers a variety of science degrees such as Actuarial Science, Industrial Chemistry, Leather Technology, Polymer Chemistry, Medical Physics and Mathematics & Modeling Processes."
      ]
    },
    {
      "tag": "science_postgraduate_programs",
      "patterns": [
        "science masters",
        "msc in science",
        "postgraduate courses in school of science",
        "phd in science"
      ],
      "responses": [
        "Postgraduate programmes include MSc in Leather Technology, MSc in Chemistry, MSc in Industrial Biochemistry, MSc in Laser & Photonic Technology, MSc in Industrial Mathematics, and a PhD in Chemistry. Admission usually requires a relevant bachelor's degree with strong academic performance."
      ]
    },
    {
      "tag": "science_entry_requirements",
      "patterns": [
        "science entry requirements",
        "requirements for science courses",
        "how to join school of science",
        "minimum requirements for science degree"
      ],
      "responses": [
        "Most science degree programmes require a KCSE mean grade of C+ with strong performance in Mathematics, English/Kiswahili and relevant science subjects. Specific requirements vary by programme."
      ]
    },
    {
      "tag": "business_overview",
      "patterns": [
        "tell me about the school of business",
        "school of business details",
        "about business school",
        "business faculty at dekut"
      ],
      "responses": [
        "The School of Business, Management & Economics offers business-oriented programmes designed to build strong analytical, managerial and entrepreneurial skills. The school combines theory, practical case studies and industry exposure."
      ]
    },
    {
      "tag": "business_leadership",
      "patterns": [
        "who is the dean of business",
        "business dean",
        "leader of school of business",
        "business school leadership"
      ],
      "responses": [
        "The School of Business, Management & Economics is led by Dean Dr. Anne Sang. The school oversees undergraduate, diploma and postgraduate programmes in business-related disciplines."
      ]
    },
    {
      "tag": "business_undergraduate_programs",
      "patterns": [
        "business courses",
        "undergraduate business programs",
        "degree programs in business",
        "Bsc of Commerce",
        "bsc of Business Administration",
        "bsc of Purchasing & Supplies Management",
        "commerce and business courses"
      ],
      "responses": [
        "Business undergraduate options include Commerce, Business Administration and Purchasing & Supplies Management, plus diploma pathways for progression."
      ]
    },
    {
      "tag": "business_postgraduate_programs",
      "patterns": [
        "business masters",
        "postgraduate business courses",
        "mba",
        "phd business"
      ],
      "responses": [
        "Postgraduate programmes include: MBA, MSc Business Analytics, MSc Supply Chain Management, MSc Project Management, MSc Economics, MSc Innovation & Entrepreneurship Management, Postgraduate Diploma in Project Management, and PhD programmes in Business Administration & Management and Operations & Supply Chain Management."
      ]
    },
    {
      "tag": "business_entry_requirements",
      "patterns": [
        "business entry requirements",
        "requirements for business courses",
        "minimum requirements for commerce",
        "how to join business school"
      ],
      "responses": [
        "Degree programmes generally require a KCSE mean grade of C+ with good performance in Mathematics and English/Kiswahili, or a recognized KNEC diploma. Master's and PhD requirements vary based on academic background and experience."
      ]
    },
    {
      "tag": "nursing_overview",
      "patterns": [
        "tell me about the school of nursing",
        "nursing school details",
        "about nursing at dekut"
      ],
      "responses": [
        "The School of Nursing offers both direct and upgrading Bachelor of Science in Nursing programmes. The school emphasizes clinical competence, professionalism and healthcare leadership."
      ]
    },
    {
      "tag": "nursing_leadership",
      "patterns": [
        "who is the dean of nursing",
        "nursing dean",
        "leader of school of nursing"
      ],
      "responses": [
        "The School of Nursing is led by Dean Dr. Florence Mbuthia."
      ]
    },
    {
      "tag": "nursing_programs",
      "patterns": [
        "nursing courses",
        "bsc nursing",
        "nursing programs at dekut",
        "nursing undergraduate programs"
      ],
      "responses": [
        "The School of Nursing offers: Bachelor of Science in Nursing (Direct Entry) and Bachelor of Science in Nursing (Upgrading) for registered nurses. Requirements differ depending on the track."
      ]
    },
    {
      "tag": "nursing_requirements",
      "patterns": [
        "nursing entry requirements",
        "requirements for nursing",
        "how to join nursing programme"
      ],
      "responses": [
        "Direct-entry BSc Nursing requires a KCSE mean grade of C+ with a C+ in Biology, English/Kiswahili, Mathematics/Physics and Chemistry. The upgrading programme requires KRCHN or KRN/KRM/PH, two years of experience and valid NCK licensing."
      ]
    },
    {
      "tag": "graduate_school_overview",
      "patterns": [
        "tell me about school of graduate studies",
        "postgraduate school dekut",
        "graduate studies information"
      ],
      "responses": [
        "The School of Graduate Studies & Research coordinates all postgraduate programmes at DeKUT. It manages admissions, academic progress, research grants, thesis examinations and overall postgraduate welfare."
      ]
    },
    {
      "tag": "graduate_school_leadership",
      "patterns": [
        "who is the dean of graduate school",
        "graduate school dean",
        "leader of graduate studies"
      ],
      "responses": [
        "The School of Graduate Studies & Research is led by Dean Dr. Douglas Onyancha."
      ]
    },
    {
      "tag": "criminology_institute",
      "patterns": [
        "tell me about criminology institute",
        "criminology courses dekut",
        "forensics courses",
        "BSc Criminology & Security Management ",
        "MSc Forensics & Security Management",
        "security studies institute"
      ],
      "responses": [
        "The Institute of Criminology, Forensics and Security Studies is led by Director Mr. Dennis Miano. It offers BSc Criminology & Security Management and MSc Forensics & Security Management. Programmes align with CUE regulations and focus on applied criminology and corporate forensic management."
      ]
    },
    {
      "tag": "iggres_overview",
      "patterns": [
        "tell me about iggres",
        "geomatics courses",
        "gis courses",
        "remote sensing programs"
      ],
      "responses": [
        "The Institute of Geomatics, GIS & Remote Sensing (IGGReS), led by Director Dr. Mark K. Boitt, offers BSc Geomatics Engineering & GIS, and BSc Geospatial Information Science & Remote Sensing. It also offers postgraduate programmes including MSc GIS & Remote Sensing and a PhD in Geomatics."
      ]
    },
    {
      "tag": "iggres_programs",
      "patterns": [
        "geomatics courses",
        "BSc Geomatics Engineering & GIS",
        "BSc Geospatial Information Science & Remote Sensing"
      ],
      "responses": [
        "The Institute of Geomatics, GIS & Remote Sensing (IGGReS),  offers BSc Geomatics Engineering & GIS, and BSc Geospatial Information Science & Remote Sensing. It also offers postgraduate programmes including MSc GIS & Remote Sensing and a PhD in Geomatics."
      ]
    },
    {
      "tag": "iggres_requirements",
      "patterns": [
        "iggres entry requirements",
        "geomatics requirements",
        "gis requirements",
        "how to join geomatics"
      ],
      "responses": [
        "KCSE applicants need a C+ in Mathematics and at least a C+ in two subjects such as Physics, Chemistry, Geography, Biology or Physical Sciences. Diploma applicants require a credit in a relevant KNEC diploma such as land surveying or geomatics."
      ]
    },
    {
      "tag": "itohm_overview",
      "patterns": [
        "tell me about itohm",
        "tourism institute details",
        "hospitality school",
        "tourism courses dekut",
        "hospitality programs dekut"
      ],
      "responses": [
        "The Institute of Tourism and Hospitality Management (IToHM), led by Director Dr. Peninah W. Chege, offers programmes in sustainable tourism and hospitality. The institute focuses on tourism operations, hospitality skills, wildlife management and sustainable tourism practices."
      ]
    },
    {
      "tag": "itohm_programs",
      "patterns": [
        "tourism programs",
        "hospitality courses",
        "degree in tourism",
        "bachelor of tourism",
        "tourism courses offered"
      ],
      "responses": [
        "IToHM offers: BSc Sustainable Tourism & Hospitality Management, Diploma in Sustainable Tourism & Hospitality Management, Certificate in Institutional Accommodation & Catering Operations, and several short courses including Mountaineering & Outdoor Expeditions Guiding."
      ]
    },
    {
      "tag": "itohm_requirements",
      "patterns": [
        "tourism requirements",
        "hospitality requirements",
        "entry requirements for tourism",
        "how to join itohm"
      ],
      "responses": [
        "For BSc Sustainable Tourism & Hospitality Management, applicants need a C+ in KCSE or a relevant diploma. Diploma entry requires a C- with relevant subjects. Certificate courses require a minimum of D or D- depending on specialization."
      ]
    },
    {
      "tag": "ifbt_overview",
      "patterns": [
        "tell me about ifbt",
        "food science institute",
        "nutrition courses dekut",
        "bioresources institute"
      ],
      "responses": [
        "The Institute of Food & Bioresources Technology (IFBT), led by Director Dr. Richard Koskei, offers programmes in Food Science & Technology, Nutrition & Dietetics, and Coffee Technology & Cupping. It focuses on food processing, nutrition, quality control and applied sciences.",
        "IFBT provides industry-focused training in food sciences, nutrition, agro-processing and coffee technology under the leadership of Dr. Richard Koskei."
      ]
    },
    {
      "tag": "ifbt_programs",
      "patterns": [
        "food science programs",
        "nutrition programs",
        "courses in ifbt",
        "BSc Food Science & Technology",
        "BSc Nutrition & Dietetics",
        "coffee technology courses"
      ],
      "responses": [
        "Programmes include: BSc Food Science & Technology, BSc Nutrition & Dietetics, Diploma in Coffee Technology & Cupping, Certificate in Coffee Technology, MSc Food Science & Technology, and PhD in Food Science & Technology."
      ]
    },
    {
      "tag": "ifbt_requirements",
      "patterns": [
        "food science requirements",
        "nutrition requirements",
        "ifbt entry requirements"
      ],
      "responses": [
        "Degree programmes require a KCSE mean grade of C+ with strong passes in Chemistry, Biology and Mathematics/Physics. Diplomas require at least a C- with relevant science subjects. Certificates require D+ or D depending on the course."
      ]
    },
    {
      "tag": "itps_overview",
      "patterns": [
        "tell me about itps",
        "technical institute dekut",
        "professional programs dekut",
        "certificate courses dekut",
        "diploma courses dekut"
      ],
      "responses": [
        "The Institute of Technical & Professional Studies (ITPS), led by Director Dr. Erastus Karoki, offers diplomas, certificates and professional courses across business, engineering, tourism, IT, fashion, building technology, welding and more."
      ]
    },
    {
      "tag": "itps_diplomas",
      "patterns": [
        "diploma programs",
        "diploma courses dekut",
        "what diplomas are offered",
        "list of diploma courses"
      ],
      "responses": [
        "ITPS offers diplomas in: Business Admin, Purchasing & Supplies Management, Information Technology, Security Management, Coffee Technology & Cupping, Food Science Technology, Tourism & Hospitality, Electrical & Electronics Engineering (Power), Fashion Design, Furniture Technology, Building Technology, Metal Work & Welding."
      ]
    },
    {
      "tag": "itps_certificates",
      "patterns": [
        "certificate programs",
        "certificate courses dekut",
        "what certificates are offered",
        "certificates available"
      ],
      "responses": [
        "Certificate programmes include: Electrical & Electronics Engineering, Fashion Design, Furniture Technology, Building Technology, Welding & Design, German Language, IT, Coffee Technology, and Mountaineering & Outdoor Expeditions Guiding."
      ]
    },
    {
      "tag": "itps_professional_courses",
      "patterns": [
        "professional courses",
        "aps k",
        "cpsp k",
        "professional training dekut"
      ],
      "responses": [
        "Professional courses include APS-K, CPSP-K, ATD Level I, Siemens Mechatronic Systems Certification (SMSCP Level 1), and advanced training in procurement, accounting and mechatronics."
      ]
    },
    {
      "tag": "getri_overview",
      "patterns": [
        "tell me about getri",
        "geothermal institute",
        "geothermal courses dekut",
        "geothermal energy training"
      ],
      "responses": [
        "The Geothermal Training & Research Institute (GeTRI), led by Director Dr. Patrick Chege Kariuki, offers advanced training in geothermal energy exploration, drilling, geoscience analysis and geothermal engineering."
      ]
    },
    {
      "tag": "getri_programs",
      "patterns": [
        "geothermal programs",
        "msc geothermal",
        "geothermal postgraduate courses",
        "BSc Geology"
      ],
      "responses": [
        "Programmes include: MSc Geothermal Energy Technology, Postgraduate Diploma in Geothermal Energy, and BSc Geology. These programmes cover earth sciences, engineering and geothermal exploration."
      ]
    },
    {
      "tag": "getri_requirements",
      "patterns": [
        "geothermal requirements",
        "msc geothermal requirements",
        "geology entry requirements"
      ],
      "responses": [
        "MSc requirements include a relevant BSc in sciences or engineering with at least Second Class Upper or Second Class Lower with experience. BSc Geology requires a C+ in KCSE with strong grades in Mathematics and two science subjects."
      ]
    },
    {
      "tag": "general_studies_overview",
      "patterns": [
        "tell me about institute of general studies",
        "general studies dekut",
        "common units dekut"
      ],
      "responses": [
        "The Institute of General Studies, led by Director Prof. Theuri Matthew Mwangi, oversees university-wide common units such as Communication Skills, Business English, Philosophy, Critical Thinking, Development Studies and Gender & Development."
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "thank you",
        "thanks",
        "appreciate",
        "thanks a lot",
        "thank you so much"
      ],
      "responses": [
        "You're welcome! 😊 If you need more details about any school or programme, feel free to ask.",
        "Happy to help! Let me know if you'd like information on admissions, programmes or contacts."
      ]
    },
    {
      "tag": "fallback",
      "patterns": [
        "unknown question",
        "random",
        "i don't understand",
        "repeat please"
      ],
      "responses": [
        "I’m not fully sure about that. Could you rephrase your question or specify the programme or school you're asking about?",
        "I might not have that information yet. Please try asking in another way or specify the topic more clearly."
      ]
    }
  ]
}